# vim: filetype=zsh

#
# NOTE: .zsh_plugins.txt - antidote plugins file
#

# Deferred execution of zsh commands
romkatv/zsh-defer

# Core libraries
ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:lib

# Load essential plugins
ohmyzsh/ohmyzsh path:plugins/alias-finder
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/ansible
ohmyzsh/ohmyzsh path:plugins/autopep8 kind:fpath
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/azure
ohmyzsh/ohmyzsh path:plugins/battery
ohmyzsh/ohmyzsh path:plugins/branch
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/colemak
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/colorize
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/compleat
ohmyzsh/ohmyzsh path:plugins/composer
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/cp
ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/dnf
ohmyzsh/ohmyzsh path:plugins/dnote kind:fpath
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/extract
# ohmyzsh/ohmyzsh path:plugins/eza # here for memory, manually implemented
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/fasd
ohmyzsh/ohmyzsh path:plugins/fastfile
ohmyzsh/ohmyzsh path:plugins/firewalld
ohmyzsh/ohmyzsh path:plugins/fnm
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/genpass
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/git-auto-fetch
ohmyzsh/ohmyzsh path:plugins/git-commit
ohmyzsh/ohmyzsh path:plugins/git-escape-magic
ohmyzsh/ohmyzsh path:plugins/git-extras
ohmyzsh/ohmyzsh path:plugins/git-flow
ohmyzsh/ohmyzsh path:plugins/git-flow-avh
ohmyzsh/ohmyzsh path:plugins/git-hubflow
ohmyzsh/ohmyzsh path:plugins/git-lfs
ohmyzsh/ohmyzsh path:plugins/git-prompt
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/gitignore
# ohmyzsh/ohmyzsh path:plugins/globalias
ohmyzsh/ohmyzsh path:plugins/gnu-utils
ohmyzsh/ohmyzsh path:plugins/golang
# ohmyzsh/ohmyzsh path:plugins/gpg-agent
ohmyzsh/ohmyzsh path:plugins/grc
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/history-substring-search
ohmyzsh/ohmyzsh path:plugins/httpie kind:fpath
ohmyzsh/ohmyzsh path:plugins/jump
# ohmyzsh/ohmyzsh path:plugins/keychain
ohmyzsh/ohmyzsh path:plugins/k9s
ohmyzsh/ohmyzsh path:plugins/kind
ohmyzsh/ohmyzsh path:plugins/kitty
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/kubectx
ohmyzsh/ohmyzsh path:plugins/last-working-dir
# ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/man
ohmyzsh/ohmyzsh path:plugins/minikube
ohmyzsh/ohmyzsh path:plugins/microk8s
# ohmyzsh/ohmyzsh path:plugins/mvn
ohmyzsh/ohmyzsh path:plugins/nmap
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/nodenv
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/oc
ohmyzsh/ohmyzsh path:plugins/otp
ohmyzsh/ohmyzsh path:plugins/pep8 kind:fpath
# ohmyzsh/ohmyzsh path:plugins/per-directory-history
ohmyzsh/ohmyzsh path:plugins/perms
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/pipenv
ohmyzsh/ohmyzsh path:plugins/podman
# ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/pylint
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/qrcode
ohmyzsh/ohmyzsh path:plugins/rbw
ohmyzsh/ohmyzsh path:plugins/rsync
ohmyzsh/ohmyzsh path:plugins/rust
ohmyzsh/ohmyzsh path:plugins/safe-paste
ohmyzsh/ohmyzsh path:plugins/salt kind:fpath
ohmyzsh/ohmyzsh path:plugins/screen
# ohmyzsh/ohmyzsh path:plugins/shrink-path
# ohmyzsh/ohmyzsh path:plugins/sprunge
# ohmyzsh/ohmyzsh path:plugins/ssh
# ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/ssh
# ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/starship
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/systemadmin
ohmyzsh/ohmyzsh path:plugins/systemd
# ohmyzsh/ohmyzsh path:plugins/thefuck
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/timer
# ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/tmuxinator
ohmyzsh/ohmyzsh path:plugins/transfer
ohmyzsh/ohmyzsh path:plugins/ubuntu
ohmyzsh/ohmyzsh path:plugins/ufw kind:fpath
ohmyzsh/ohmyzsh path:plugins/universalarchive
ohmyzsh/ohmyzsh path:plugins/urltools
ohmyzsh/ohmyzsh path:plugins/vagrant
ohmyzsh/ohmyzsh path:plugins/virtualenv
ohmyzsh/ohmyzsh path:plugins/virtualenvwrapper
ohmyzsh/ohmyzsh path:plugins/vscode
ohmyzsh/ohmyzsh path:plugins/web-search
ohmyzsh/ohmyzsh path:plugins/wp-cli
ohmyzsh/ohmyzsh path:plugins/yum
ohmyzsh/ohmyzsh path:plugins/zbell
ohmyzsh/ohmyzsh path:plugins/zoxide
ohmyzsh/ohmyzsh path:plugins/zsh-interactive-cd
ohmyzsh/ohmyzsh path:plugins/zsh-navigation-tools

# Additional completions
3v1n0/zsh-bash-completions-fallback path:src kind:fpath

# Utility plugins
eth-p/bat-extras path:src kind:path
eth-p/bat-extras path:src kind:fpath
wofr06/lesspipe kind:path
wofr06/lesspipe kind:fpath
# z-shell/zsh-eza # here for memory, manually implemented

# Colors
xPMo/zsh-ls-colors

# History and completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-completions
# Atuin history manager
atuinsh/atuin branch:main

# olets/zsh-abbr # kind:defer # zsh manager for auto-expanding abbreviations

MichaelAquilina/zsh-you-should-use kind:defer

### Plugins that must be called last
# prompt 
zsh-users/zsh-syntax-highlighting
catppuccin/zsh-syntax-highlighting path:themes/catppuccin_mocha-zsh-syntax-highlighting.zsh
zdharma-continuum/fast-syntax-highlighting
# marlonrichert/zsh-autocomplete # Find as you type, then press Tab to insert the top completion or ↓to select another completion.
zsh-users/zsh-autosuggestions

# FZF
Aloxaf/fzf-tab

# GPT
# tom-doerr/zsh_codex
# Alby11/zsh_codex

### THEME
# romkatv/powerlevel10k # using starship ATM

# WakaTime for Terminal
sobolevn/wakatime-zsh-plugin

# Load plugins configurations after all plugins are loaded
"${ZDOTDIR}/.zsh_plugins_configurations"
